app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-06-10 02:24:09.828949"], ["updated_at", "2018-06-10 02:24:09.828949"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-06-10 02:25:54.672210"], ["updated_at", "2018-06-10 02:25:54.672210"]]
---
  def upload
    # binding.pry
    CSV.foreach(params[:file].path, headers: true) do |lead|
      # binding.pry
      Song.create(title: lead[0], artist_name: lead[1])